{
  "tips" : [
    {
      "id" : 0,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "Welcome:",
      "content" : "The article Poppy Playtime Unblocked is about the recently launched game. To read the details, please go through this news. How freak are you for games? What type of games are you interested in playing? Do you like creepy puzzle games? What if you get the combination of horror and puzzle at the same time? So today, we will talk about one such game that is gaining immense popularity among the players from the United States and other parts of the world. Have you heard about Poppy Playtime yet? If not, we are going to discuss Poppy Playtime Unblocked. So be with us till the end to explore every fun of the game."
    },
    {
      "id" : 1,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "What is Poppy Playtime?",
      "content" : "If you want to enjoy the scariest game ever, then Poopy playtime falls in the category of survival horror. The game was launched recently and is gaining the attention of gamers. It is a puzzle type of game where you will land in an abandoned toy factory. Here, you have to fight against some toys in the toy factory that tries to kill you. So you have not only to explore the factory but also solve riddles and stay alive till the end."
    },
    {
      "id" : 2,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "What is Poppy Playtime Unblocked?",
      "content" : "The toy factory has its own story. A long time ago, playtime was the biggest toy-making company. But suddenly, one by one, the workers mysteriously started disappearing. Finally, the investigation came to a pause, and everyone started forgetting the case except one worker.The one who left decided to haunt the past and check to find any clue. For this, he landed in the abandoned building to investigate from the beginning. But something else is waiting ahead, and it is not in his hand to control."
    },
    {
      "id" : 3,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "The more scary thing about Poppy Playtime Unblocked:",
      "content" : "The most challenging thing about the game is that you cannot leave the building, and soon the frightening sounds start coming from the corners. So next, the worker tries to protect himself from the cruel monster.Huggy Wuggy is the most dangerous amongst all. But unlike him, many try to catch you; once they catch you, the game is over. Your aim is to escape and ignore the frightening look and continue to search for the co-workers. You will also get the tools to aid your investigation.Usually, horror games aim to create alien creatures and scary figures. But sometimes, even the friendliest one can turn into a monstrosity. Poppy Playtime Unblocked is about turning the plain toys into your biggest horror opponent. "
    },
    {
      "id" : 4,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "System requirements for the game:",
      "content" : "The minimum requirement is Windows 10 OS with a 64-bit processor. However, the game was launched recently and is a bit heavy, so you also need the following for better performance: *Graphics Radeon RX 580 or GeForce GTX 1060. *8GB RAM *Minimum 10GB storage space."
    },
    {
      "id" : 5,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "Conclusion:",
      "content" : "Developed by MOB games, Poppy playtime is addictive and loved by many users and gained popularity within a short time of its release. It is an action, riddle, mystery, survival, horror-based theme game. Poppy Playtime Unblocked received all positive reviews, and users liked the unique plot of the game. For more about the game and the latest update, follow here."
    },
    {
      "id" : 6,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "The more scary thing about Poppy Playtime Unblocked:",
      "content" : "The most challenging thing about the game is that you cannot leave the building, and soon the frightening sounds start coming from the corners. So next, the worker tries to protect himself from the cruel monster.Huggy Wuggy is the most dangerous amongst all. But unlike him, many try to catch you; once they catch you, the game is over. Your aim is to escape and ignore the frightening look and continue to search for the co-workers. You will also get the tools to aid your investigation.Usually, horror games aim to create alien creatures and scary figures. But sometimes, even the friendliest one can turn into a monstrosity. Poppy Playtime Unblocked is about turning the plain toys into your biggest horror opponent. "
    },
    {
      "id" : 7,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "System requirements for the game:",
      "content" : "The minimum requirement is Windows 10 OS with a 64-bit processor. However, the game was launched recently and is a bit heavy, so you also need the following for better performance: *Graphics Radeon RX 580 or GeForce GTX 1060. *8GB RAM *Minimum 10GB storage space."
    },
    {
      "id" : 8,
      "image" : "https://m.media-amazon.com/images/I/819Y8vB1MjL.png",
      "name" : "Conclusion:",
      "content" : "Developed by MOB games, Poppy playtime is addictive and loved by many users and gained popularity within a short time of its release. It is an action, riddle, mystery, survival, horror-based theme game. Poppy Playtime Unblocked received all positive reviews, and users liked the unique plot of the game. For more about the game and the latest update, follow here."
    }
  ]
}